# parameters
nc: 5  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
# LCNet_Block_H_PConv 此配置文件中的为8  self.pconv = PConv(num_channels,8)
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [ [ -1, 1, CBH, [ 32, 3, 2 ] ],    # 0-P2/4
    [ -1, 1, LCNet_Block_H_PConv, [ 64, 2, 3, False ] ], # 1-P3/8
    [ -1, 1, LCNet_Block_H_PConv, [ 64, 1, 3, False ] ], # 2-P4/16

    [ -1, 1, LCNet_Block_H_PConv, [ 128, 2, 3, False ] ], # 3
    [ -1, 1, LCNet_Block_H_PConv, [ 128, 1, 3, False ] ], # 4
    [ -1, 1, LCNet_Block_H_PConv, [ 128, 1, 3, False ] ], # 5
    [ -1, 1, LCNet_Block_H_PConv, [ 128, 1, 3, False ] ], # 6

    [ -1, 1, LCNet_Block_H_PConv, [ 256, 2, 3, False ] ], # 7-P5/32
    [ -1, 1, LCNet_Block_H_PConv, [ 256, 1, 5, False ] ],#8
    [ -1, 1, LCNet_Block_H_PConv, [ 256, 1, 5, False ] ],# 9-P5/32
    [ -1, 1, LCNet_Block_H_PConv, [ 256, 1, 5, False ] ],# 10
    [ -1, 1, LCNet_Block_H_PConv, [ 256, 1, 5, False ] ], # 11
    [ -1, 1, LCNet_Block_H_PConv, [ 256, 1, 5, False ] ], # 12-P5/32

    [ -1, 1, LCNet_Block_H_PConv, [ 512, 2, 5, False ] ],#13
    [ -1, 1, LCNet_Block_H_PConv, [ 512, 1, 5, False ] ], # 14-P5/32
    [ -1, 1, LCNet_Block_H_PConv, [ 512, 1, 5, False ] ], # 15
    [ -1, 1, LCNet_Block_H_PConv, [ 512, 1, 5, False ] ], # 16
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],#17
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],#18
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  #25

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [12, 1, GSConv, [128, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],#29

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  #35

   [-1, 1, GSConv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 45

   [-1, 1, Conv, [128, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 28, 35], 1, Concat, [1]],

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 53

   [-1, 1, Conv, [256, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 25], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  #61

   [45, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],#62
   [53, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [61, 1, Conv, [512, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[62,63,64], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]